Dennis-van-Gils/DvG_Arduino_lock-in_amp/source_Atmel_Studio/project_LIA_SAMD21/LIA_SAMD21/main.c
/*
void memset32(void *dest, uint32_t value, uintptr_t size) {
    uintptr_t i;
    for(i = 0; i < (size & (~3)); i+=4) {
        memcpy( ((char*)dest) + i, &value, 4);
    }
    for( ; i < size; i++) {
        ((char *) dest)[i] = ((char *) &value)[i&3];
    }
}
*/

/*
// Calculate free SRAM during run-time (32 KB available on SAMD21)
size_t get_free_RAM() {
    char stack_dummy = 0;
    return (&stack_dummy - sbrk(0));
}
*/

/*------------------------------------------------------------------------------
    SYSTICK
------------------------------------------------------------------------------*/

/* We use SYSTICK for time stamping at a microsecond resolution. The SYSTICK
interrupt service routine is set to fire every 1 millisecond. Anything faster
than this will result in a too heavy a burden on system resources and will
deteriorate the timing accuracy. The microsecond part can be retrieved when
needed, see 'get_systick_timestamp'.

Note: The millis counter will roll over after 49.7 days.
*/

void SysTick_Handler(void) {
    millis++;
}

void get_systick_timestamp(uint32_t *stamp_millis,
                           uint16_t *stamp_micros_part) {
    // Adapted from: https://github.com/arduino/ArduinoCore-samd/blob/master/cores/arduino/delay.c
    uint32_t ticks, ticks2;
    uint32_t pend, pend2;
    uint32_t count, count2;

    ticks2 = SysTick->VAL;
    pend2  = !!(SCB->ICSR & SCB_ICSR_PENDSTSET_Msk)  ;
    count2 = millis ;

    do {
        ticks  = ticks2;
        pend   = pend2;
        count  = count2;
        ticks2 = SysTick->VAL;
        pend2  = !!(SCB->ICSR & SCB_ICSR_PENDSTSET_Msk)  ;
        count2 = millis;
    } while ((pend != pend2) || (count != count2) || (ticks < ticks2));

    (*stamp_millis) = count2;
    if (pend) {(*stamp_millis)++;}
    (*stamp_micros_part) = (( (SysTick->LOAD - ticks) *
                              (1048576 / (VARIANT_MCK/1000000)) ) >> 20);
}



/*------------------------------------------------------------------------------
    USB print
------------------------------------------------------------------------------*/

void usb_print(const char *str_msg) {
    sprintf(usb_buffer, "%s", str_msg);
    cdcdf_acm_write((uint8_t *) usb_buffer, strlen(usb_buffer));
}



/*------------------------------------------------------------------------------
    USART
------------------------------------------------------------------------------*/

void io_write_blocking(uint8_t *data, uint16_t len) {
    is_serial_txc = false;
    io_write(io, data, len);
    while (!is_serial_txc) {}
}

void io_print(const char *str_msg) {
    // Blocking
    is_serial_txc = false;
    io_write(io, (uint8_t *) str_msg, strlen(str_msg));
    while (!is_serial_txc) {}
}

void io_print_timestamp(void) {
    // Report time in microseconds
    static char buf[16];
    uint32_t millis_copy;
    uint16_t micros_part;

    get_systick_timestamp(&millis_copy, &micros_part);
    sprintf(buf, "%lu %03u\n", millis_copy, micros_part);
    io_print(buf);
}

static void cb_USART_txc(const struct usart_async_descriptor *const io_descr) {
    is_serial_txc = true;
}

static void cb_USART_rxc(const struct usart_async_descriptor *const io_descr) {
    is_serial_rxc = true;
}

static void cb_USART_err(const struct usart_async_descriptor *const io_descr) {
    usb_print("USART ERROR\n");
}



/*------------------------------------------------------------------------------
    get_mcu_uid
------------------------------------------------------------------------------*/

void get_mcu_uid(uint8_t raw_uid[16]) {
    // Return the 128-bits uid (serial number) of the micro controller as a byte
    // array. Mashed up from:
    // https://github.com/adafruit/circuitpython/blob/master/ports/atmel-samd/common-hal/microcontroller/Processor.c
    // https://github.com/adafruit/circuitpython/blob/master/shared-bindings/microcontroller/Processor.c

  #ifdef _SAMD21_
    uint32_t* id_addr[4] = {(uint32_t *) 0x0080A00C, (uint32_t *) 0x0080A040,
                            (uint32_t *) 0x0080A044, (uint32_t *) 0x0080A048};
  #endif
  #ifdef _SAMD51_
    uint32_t* id_addr[4] = {(uint32_t *) 0x008061FC, (uint32_t *) 0x00806010,
                            (uint32_t *) 0x00806014, (uint32_t *) 0x00806018};
  #endif

    for (int i = 0; i < 4; i++) {
        for (int k = 0; k < 4; k++) {
            raw_uid[4 * i + k] = (*(id_addr[i]) >> k * 8) & 0xff;
        }
    }
}

void format_byte_array_as_hex8string(char *str_out,
                                     uint8_t str_maxlen,
                                     const uint8_t *byte_array) {
    // Format a byte array to a C-string containing the hex representation,
    // preserving leading 0's per uint8_t.
    // Source: https://forum.arduino.cc/index.php?topic=38107.msg282342#msg282342
    uint8_t n_bytes = sizeof(byte_array);
    uint8_t str_len = min(2 * n_bytes + 1, str_maxlen);
    uint8_t i_max = (uint8_t) floor(str_len - 1) / 2;

    char b1;
    char b2;
    for (int i = 0; i < i_max; i++) {
        b1 = (byte_array[i] >> 4) & 0x0f;
        b2 = byte_array[i] & 0x0f;
        // Base for converting single digit numbers to ASCII is 48
        // Base for 10-16 to become lower-case characters a-f is 87
        // Note: difference is 39
        str_out[i * 2]     = b1 + 48;
        str_out[i * 2 + 1] = b2 + 48;
        if (b1 > 9) str_out[i * 2]     += 39;
        if (b2 > 9) str_out[i * 2 + 1] += 39;
    }
    str_out[str_len - 1] = 0; // C-string termination character
}



/*------------------------------------------------------------------------------
    Waveform look-up table (LUT)
------------------------------------------------------------------------------*/
/*
In order to drive the DAC at high sampling speeds, we compute the reference
waveform in advance by a look-up table (LUT). The LUT will contain the samples
for one complete period of the waveform. The LUT is statically allocated and can
fit up to 'MAX_N_LUT' number of samples.
Because the 'SAMPLING_PERIOD_us' is fixed and the LUT can only have an integer
number of samples 'N_LUT', the possible wave frequencies are discrete.
That means that there is a distinction between the wanted frequency and the
obtained frequency 'ref_freq'.
*/

// Align the trigger out signal with the 0-phase position of the waveform being
// output by the DAC. The trigger out signal is controlled by function
// 'cb_DAC_0_conversion_done'
#define LUT_OFFSET_TRIG_OUT 1

// The ADC readings lag behind the DAC output by 1 sample
#define SAMPLE_OFFSET_ADC_DAC 1

