Dennis-van-Gils/DvG_Arduino_lock-in_amp/source_Atmel_Studio/project_LIA_SAMD21/LIA_SAMD21/main.c
void parse_freq(const char const *str_value) {
    ref_freq = atof(str_value);
    N_LUT = (uint16_t) round(SAMPLING_RATE_Hz / ref_freq);
    N_LUT = max(N_LUT, MIN_N_LUT);
    N_LUT = min(N_LUT, MAX_N_LUT);
    ref_freq = SAMPLING_RATE_Hz / N_LUT;
}

void parse_offs(const char const *str_value) {
    ref_V_offset = atof(str_value);
    ref_V_offset = max(ref_V_offset, 0.0);
    ref_V_offset = min(ref_V_offset, A_REF);
}

void parse_ampl(const char const *str_value) {
    ref_V_ampl = atof(str_value);
    ref_V_ampl = max(ref_V_ampl, 0.0);
    ref_V_ampl = min(ref_V_ampl, A_REF);
}

void compute_LUT(uint16_t *LUT_array) {
    double offs = ref_V_offset / A_REF;    // Normalized
    double ampl = ref_V_ampl   / A_REF;    // Normalized
    double wave;

    uint32_t tick = millis;
    io_print("Computing LUT...\n");

    int16_t fq_N_LUT = (int16_t) floor(N_LUT / 4.0); // Floor quarter N_LUT
    int16_t cq_N_LUT = (int16_t) ceil (N_LUT / 4.0); // Ceil  quarter N_LUT

    if (ref_waveform != ECG) {
        for (int16_t i = 0; i < N_LUT; i++) {
            switch (ref_waveform) {
                default:
                case Cosine:
                    wave = cos(2*M_PI*(i + LUT_OFFSET_TRIG_OUT) / N_LUT);
                    wave = offs + ampl * wave;
                    break;

                case Square:
                    wave = ((i + LUT_OFFSET_TRIG_OUT + fq_N_LUT) % N_LUT) /
                           (N_LUT - 1.0);
                    wave = 1.0 - round(wave);
                    wave = (offs - ampl) + 2 * ampl * wave;
                    break;

                case Sawtooth:
                    wave = ((i + LUT_OFFSET_TRIG_OUT + N_LUT - cq_N_LUT) % N_LUT) /
                           (N_LUT - 1.0);
                    wave = (offs - ampl) + 2 * ampl * wave;
                    break;

                case Triangle:
                    wave = (((i + LUT_OFFSET_TRIG_OUT) * 2) % N_LUT) /
                           (N_LUT - 1.0);
                    if ((i + LUT_OFFSET_TRIG_OUT) % N_LUT < (N_LUT / 2.0 )) {
                        wave = 1.0 - wave;
                    }
                    wave = (offs - ampl) + 2 * ampl * wave;
                    break;
            }

            wave = max(wave, 0.0);
            wave = min(wave, 1.0);
            LUT_array[i] = (uint16_t) round(MAX_DAC_OUTPUT_BITVAL * wave);
        }
    } else {
        if (prev_ECG_N_LUT != N_LUT) {
            generate_ECG(ecg_wave, N_LUT);
            prev_ECG_N_LUT = N_LUT;
        }

        for (uint16_t i = 0; i < N_LUT; i++) {
            wave = (offs - ampl) +
                   2 * ampl * ecg_wave[(i + LUT_OFFSET_TRIG_OUT) % N_LUT];
            wave = max(wave, 0.0);
            wave = min(wave, 1.0);
            LUT_array[i] = (uint16_t) round(MAX_DAC_OUTPUT_BITVAL * wave);
        }
    }

    is_LUT_dirty = false;

    sprintf(str_buffer, " done in %lu ms\n", millis - tick);
    io_print(str_buffer);
}

void write_time_and_phase_stamp_to_TX_buffer(uint8_t *TX_buffer) {
    /*
    Write timestamp and 'phase'-stamp of the first ADC sample of the buffer that
    is about to be sent out over the serial port. We need to know which
    phase angle was output on the DAC, that corresponds in time to the first ADC
    sample of the TX_buffer. This is the essence of a phase-sensitive detector,
    which is the building block of a lock-in amplifier.
    */

    uint32_t millis_copy;
    uint16_t micros_part;
    uint16_t idx_phase;
    //uint32_t t1;
    //uint32_t t2;
    //volatile uint32_t dt;

    //t2 = SysTick->VAL;
    get_systick_timestamp(&millis_copy, &micros_part);
    //t1 = SysTick->VAL;
    //dt = t2 - t1;

    // Modulo takes more cycles when time increases.
    // Is max 164 clock cycles when (2^24 % N_LUT).
    idx_phase = (TIMER_0.time + N_LUT + LUT_OFFSET_TRIG_OUT +
                 SAMPLE_OFFSET_ADC_DAC) % N_LUT;

    TX_buffer_counter++;
    TX_buffer[TX_BUFFER_OFFSET_COUNTER    ] = TX_buffer_counter;
    TX_buffer[TX_BUFFER_OFFSET_COUNTER + 1] = TX_buffer_counter >> 8;
    TX_buffer[TX_BUFFER_OFFSET_COUNTER + 2] = TX_buffer_counter >> 16;
    TX_buffer[TX_BUFFER_OFFSET_COUNTER + 3] = TX_buffer_counter >> 24;
    TX_buffer[TX_BUFFER_OFFSET_MILLIS     ] = millis_copy;
    TX_buffer[TX_BUFFER_OFFSET_MILLIS  + 1] = millis_copy >> 8;
    TX_buffer[TX_BUFFER_OFFSET_MILLIS  + 2] = millis_copy >> 16;
    TX_buffer[TX_BUFFER_OFFSET_MILLIS  + 3] = millis_copy >> 24;
    TX_buffer[TX_BUFFER_OFFSET_MICROS     ] = micros_part;
    TX_buffer[TX_BUFFER_OFFSET_MICROS  + 1] = micros_part >> 8;
    TX_buffer[TX_BUFFER_OFFSET_PHASE      ] = idx_phase;
    TX_buffer[TX_BUFFER_OFFSET_PHASE   + 1] = idx_phase >> 8;
}



/*------------------------------------------------------------------------------
    DAC
------------------------------------------------------------------------------*/

static void cb_DAC_0_conversion_done(struct dac_async_descriptor *const descr,
                                     const uint8_t ch) {
    // Copy a new full period of the waveform into the DAC output buffer
    if (is_running) {
        gpio_set_pin_level(PIN_D0__TRIG_OUT, true);
        dac_async_write(descr, 0, LUT_wave, N_LUT);
        gpio_set_pin_level(PIN_D0__TRIG_OUT, false);
    }
}



/*------------------------------------------------------------------------------
    ADC
------------------------------------------------------------------------------*/

static void cb_ADC_0_error(const struct adc_dma_descriptor *const descr) {
    usb_print("ADC_0 ERROR\n");
}

static void cb_ADC_0_complete(const struct adc_dma_descriptor *const descr) {
    /*
    if (ADC->INTFLAG.bit.OVERRUN == 1) {
        usb_print("OVERRUN\n");
        ADC->INTENSET.bit.OVERRUN = 1;
    }
    */

    if (is_running) {
        if (using_TX_buffer_A) {
            if (TX_buffer_counter == 0) {
                // Start-up routine. Discard the first read ADC samples.
            } else {
                // Trigger DMA channel 1: Send out TX_buffer_A
                _dma_enable_transaction(1, false);
            }

